# pandas层次化索引

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [18]:
data = pd.read_excel('test_1.xlsx',header=[0,1],index_col=[0,1])

In [19]:
data

            上半年               下半年
             收入    成本    费用    收入    成本    费用
黑龙江公司 92#  6980  1711   554  4798  4580   996
      95#  6112  2484  1862  1354  3179   902
      90#  4965  1818  1257  5991  3452  1067
北京公司  92#  9317  1713  1261  1614  2385  1100
      95#  4473  2161  1148  4300  4048   526
      90#  8328  1531   900  6031  1092   755

In [20]:
data.columns

MultiIndex([('上半年', '收入'),
            ('上半年', '成本'),
            ('上半年', '费用'),
            ('下半年', '收入'),
            ('下半年', '成本'),
            ('下半年', '费用')],
           )

In [2]:
columns = pd.MultiIndex.from_product([["上半年","下半年"],["收入","成本","费用"]])

## 1.多层行索引

  除了行索引index，列索引columns也能用同样的方法创建多层索引。

In [23]:
columns

MultiIndex([('上半年', '收入'),
            ('上半年', '成本'),
            ('上半年', '费用'),
            ('下半年', '收入'),
            ('下半年', '成本'),
            ('下半年', '费用')],
           )

In [5]:
data_1 = np.random.randint(0,10000,size=(3,6))
index = ['92#','95#','90#']
df_1=DataFrame(data_1,index=index,columns=columns)
df_1

      上半年               下半年
       收入    成本    费用    收入    成本    费用
92#  7954  8820  3849  5452  9895  7950
95#  8832   233  5017  8915  8532  9760
90#  9174  2850  4946  9540  8971  9134

In [7]:
data_2 = np.random.randint(0,100,size=(2,4))

In [10]:
cols = pd.MultiIndex.from_product([["期中","期末"],["Python",'Java']])

In [11]:
index = ['张三','李四']

In [12]:
df_2 = DataFrame(data_2,index=index,columns=cols)
df_2

       期中          期末
   Python Java Python Java
张三     58   78     28   47
李四     26   40      5    2

## 2.多层索引对象的索引与切片操作

需求：
    构建一个多层级列索引成绩表，分值在0~100内随机。  
    一级标题为上学期和下学期，二级标题为python、java、c，行标签为tom、lucy、jack。  
    1.获取上学期lucy成绩的最高分是哪门学科；  
    2.同时获取上学期和下学期tom的成绩，计算tom的各学科平均成绩。  
    3.获取上学期jack的python成绩，并给他加20分。

In [2]:
data_3 = np.random.randint(0,100,size=(3,6))

In [3]:
index_2 = ['tom','lucy','jack']

In [4]:
cols_2 = pd.MultiIndex.from_product([['上学期','下学期'],['python','java','c']])

In [7]:
df_3 = DataFrame(data_3,index=index_2,columns=cols_2)
df_3

        上学期             下学期
     python java   c python java   c
tom      40   61  95     20   98  95
lucy     75   43  84     23    9   8
jack     51   46  58     53   84  68

### （1）Series的操作  
【重要】对于Series来说，直接用中括号[]与使用.loc()完全一样，推荐使用.loc[]索引和切片。  
     -  索引  
     -  切片

In [8]:
tmp_sxq = df_3['上学期']
tmp_sxq

      python  java   c
tom       40    61  95
lucy      75    43  84
jack      51    46  58

### （2）DataFrame的操作    
     -  直接使用列名称来进行索引
     -  行多级索引的索引与切片操作

In [9]:
df_3.loc['tom',('上学期','python')]

40

In [10]:
df_3[[('下学期','python'),('上学期','python')]]

        下学期    上学期
     python python
tom      20     40
lucy     23     75
jack     53     51

In [16]:
#隐式索引不受多层级索引的影响，隐式索引永远是单层级。
df_3.iloc[:,[0,3]]

        上学期    下学期
     python python
tom      40     20
lucy     75     23
jack     51     53

### （3）多层级索引的变形操作（stack）    
     -  stack() 使用stack()的时候，level等于哪一个，哪一个就消失，出现在行里。
     -  unstack() 使用unstack()的时候，level等于哪一个，哪一个就消失，出现在列里。

In [17]:
df_4 = df_3.copy()

In [18]:
df_4

        上学期             下学期
     python java   c python java   c
tom      40   61  95     20   98  95
lucy     75   43  84     23    9   8
jack     51   46  58     53   84  68

In [23]:
#level默认值为-1
df_4.stack(level=-2)

           c  java  python
tom  上学期  95    61      40
     下学期  95    98      20
lucy 上学期  84    43      75
     下学期   8     9      23
jack 上学期  58    46      51
     下学期  68    84      53